sdaiInsertByIndex(Sdai_Id_aggr*,System.UInt32,SdaiPrimitiveType,BTEllipsis)
\details
Inserts a new value into an application instance list on a position specified by an index value.
\param list      [in] A list for the insertion.
\param index     [in] An index value that defines the position to insert a new value.
\param valueType [in] A type of the inserted value.
\remarks
You can insert more than one value into the list: pass as many values as you need after the parameter that specifies the data type.